#### RoofComponents Members

---

|  |
| --- |
| RoofComponents Class   Methods   Properties   See Also |

The  RoofComponents  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  RoofComponents |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetAreasOfCurveLoops | The areas of CurveLoops of roof slabs. |
| Public method | GetCurveLoops | The CurveLoops of roof slabs. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetLoopFaces | The faces of the loops of roof slabs. |
| Public method | GetPlaneDirections | The plane directions of roof slabs. |
| Public method | GetPlaneOrigins | The plane origins of roof slabs. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | ScaledDepth | The depth of the roof slab. |

# See Also

RoofComponents Class

Autodesk.Revit.DB.IFC Namespace